app/controllers/home_controller.rb

  def profile
    @account  = Account.find_by_id(session[:user_id])
    @user = User.find_by_account_id(@account.id)
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` IS NULL) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`account_id` = 1) LIMIT 1

  def create

   @account  = Account.find_by_id(params[:id])
   @user = User.find_by_account_id(@account.id)

   if @user.blank?
        @user = User.new(params[:user])
         if @user.save
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` = '1') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`account_id` = 1) LIMIT 1
SELECT "users".id FROM "users" WHERE (myname = 'siva-krishna-nyros' and id != 3) LIMIT 1
INSERT INTO "users" ("city", "postal_code", "updated_at", "account_id", "country", "myname", "picture", "full_name", "address", "province", "created_at") VALUES('kakinada', '531116', '2009-11-03 12:16:28', 1, 'india', NULL, '20102008050416600122451vm1.jpg', 'siva Krishna', 'dno-3-4-25', 'ap', '2009-11-03 12:16:28')
UPDATE "users" SET "created_at" = '2009-11-03 12:16:28', "city" = 'kakinada', "picture" = '20102008050416600122451vm1.jpg', "country" = 'india', "postal_code" = '531116', "account_id" = 1, "province" = 'ap', "address" = 'dno-3-4-25', "full_name" = 'siva Krishna', "myname" = 'siva-krishna', "updated_at" = '2009-11-03 12:16:28' WHERE "id" = 1

  def show
    @user = User.find_by_account_id(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`account_id` IS NULL) LIMIT 1