app/controllers/login_controller.rb

  def index
    @page_title = "Welcome to MyProfile"
    if !session[:user_id].blank?
     redirect_to :controller => 'home',:action => 'show', :id => session[:user_id]
     end
    @account = Account.new
    @account_data = User.find_by_myname(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`myname` = 'siva-krishna') LIMIT 1

  def signup
     @page_title = "Enter Signup deatils for Your Account"
    if request.post?
     @account = Account.new(params[:account])
     if @account.save
---
INSERT INTO "accounts" ("updated_at", "password_salt", "password_hash", "user_name", "created_at") VALUES('2009-11-03 12:10:42', '-6109253780.029767041896849', '6e49ef56db7b5063f87c91d578171cec6a412e70', 'siva', '2009-11-03 12:10:42')

 def signin
   if request.post?
    @account = Account.authenticate(params[:username], params[:password])

    if !@account.blank?
---
SELECT * FROM `accounts` WHERE (user_name LIKE 'siva' AND password LIKE 'krishna') LIMIT 1